notebook/rlxtodo.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>RLX Project TODO list</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-01 20:22:59 EDT"/>
<meta name="author" content="David O'Toole <dto@gnu.org>"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">RLX Project TODO list</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="todo TODO"> TODO</span> Example RLX game </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Turn-based with abstract pseudo-ascii glyphs </h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Move and shoot in any of 8 directions </h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Loosely defined maze with different color areas </h3>
<div class="outline-text-3" id="text-1-3">

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Single player is a green square </h3>
<div class="outline-text-3" id="text-1-4">

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Enemies are red triangles and blue diamonds etc </h3>
<div class="outline-text-3" id="text-1-5">

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Yellow/orange diamonds are energy crystals </h3>
<div class="outline-text-3" id="text-1-6">

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Blue tanks are oxygen </h3>
<div class="outline-text-3" id="text-1-7">

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8">Blue guns are ammo </h3>
<div class="outline-text-3" id="text-1-8">

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9">Ammunition is limited &mdash; take care with each shot </h3>
<div class="outline-text-3" id="text-1-9">

</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10">Message area </h3>
<div class="outline-text-3" id="text-1-10">

</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11">Different enemies have different movements and attacks </h3>
<div class="outline-text-3" id="text-1-11">

</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12">Dark blue background, cyan walls </h3>
<div class="outline-text-3" id="text-1-12">

</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13">Heart beat sound </h3>
<div class="outline-text-3" id="text-1-13">

</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14">life, oxygen and energy meters with cool chunky E O L letters next to them </h3>
<div class="outline-text-3" id="text-1-14">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Gameplay redesign principles </h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>Reduce workload by refitting the game design to already written code.
</li>
<li>Implement static missions and campaigns first, and get something
   playable sooner. 
</li>
<li>Implement cooler dynamic procedural generation stuff later. 
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Gameplay design </h2>
<div class="outline-text-2" id="text-3">


<p>
Void Mission is a "mech sim RPG" for Windows, Macintosh, and GNU/Linux.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Assemble and pilot a mech composed of interchangeable parts. </h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Core </h4>
<div class="outline-text-4" id="text-3-1-1">

</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Head </h4>
<div class="outline-text-4" id="text-3-1-2">

</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">Arms </h4>
<div class="outline-text-4" id="text-3-1-3">

</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">Legs </h4>
<div class="outline-text-4" id="text-3-1-4">

</div>

</div>

<div id="outline-container-3-1-5" class="outline-4">
<h4 id="sec-3-1-5">Generator </h4>
<div class="outline-text-4" id="text-3-1-5">

</div>

</div>

<div id="outline-container-3-1-6" class="outline-4">
<h4 id="sec-3-1-6">Radiator </h4>
<div class="outline-text-4" id="text-3-1-6">

</div>

</div>

<div id="outline-container-3-1-7" class="outline-4">
<h4 id="sec-3-1-7">Booster </h4>
<div class="outline-text-4" id="text-3-1-7">

</div>

</div>

<div id="outline-container-3-1-8" class="outline-4">
<h4 id="sec-3-1-8">Right Arm Unit </h4>
<div class="outline-text-4" id="text-3-1-8">

</div>

</div>

<div id="outline-container-3-1-9" class="outline-4">
<h4 id="sec-3-1-9">Left Arm Unit </h4>
<div class="outline-text-4" id="text-3-1-9">

</div>

</div>

<div id="outline-container-3-1-10" class="outline-4">
<h4 id="sec-3-1-10">Right Back Unit </h4>
<div class="outline-text-4" id="text-3-1-10">

</div>

</div>

<div id="outline-container-3-1-11" class="outline-4">
<h4 id="sec-3-1-11">Left Back Unit </h4>
<div class="outline-text-4" id="text-3-1-11">

</div>

</div>

<div id="outline-container-3-1-12" class="outline-4">
<h4 id="sec-3-1-12">Fire Control System </h4>
<div class="outline-text-4" id="text-3-1-12">

</div>

</div>

<div id="outline-container-3-1-13" class="outline-4">
<h4 id="sec-3-1-13">Radar </h4>
<div class="outline-text-4" id="text-3-1-13">

</div>

</div>

<div id="outline-container-3-1-14" class="outline-4">
<h4 id="sec-3-1-14">Extension </h4>
<div class="outline-text-4" id="text-3-1-14">

</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Buy and sell parts, ammunition </h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Profit-and-loss after each sortie </h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Turn-based action in a 16x16 tile-based world&hellip; true-color + transparency </h3>
<div class="outline-text-3" id="text-3-4">

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">Radar display in top-right corner. May or may not also display map contours (depends on equipped part) </h3>
<div class="outline-text-3" id="text-3-5">

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">Different locations and planets, each with unique missions </h3>
<div class="outline-text-3" id="text-3-6">

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">A balance of ranged combat and close-quarters melee </h3>
<div class="outline-text-3" id="text-3-7">

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">Mission-based gameplay, with missions arranged into story-oriented campaigns. </h3>
<div class="outline-text-3" id="text-3-8">

</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9">Users can create new missions, parts, enemies, mods, music/textures </h3>
<div class="outline-text-3" id="text-3-9">

</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10">Boosting allows your mech to move very quickly for a short period (determined by generator/radiator etc) </h3>
<div class="outline-text-3" id="text-3-10">

</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11">Parts and actions have heat ratings, you must manage environmental and mech-generated heat </h3>
<div class="outline-text-3" id="text-3-11">

</div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12">Radar jamming </h3>
<div class="outline-text-3" id="text-3-12">


</div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13">Variety of gameplay styles depending on mission and parts equipped </h3>
<div class="outline-text-3" id="text-3-13">


</div>

<div id="outline-container-3-13-1" class="outline-4">
<h4 id="sec-3-13-1">Shooter </h4>
<div class="outline-text-4" id="text-3-13-1">

</div>

</div>

<div id="outline-container-3-13-2" class="outline-4">
<h4 id="sec-3-13-2">Arena Duel </h4>
<div class="outline-text-4" id="text-3-13-2">

</div>

</div>

<div id="outline-container-3-13-3" class="outline-4">
<h4 id="sec-3-13-3">Exploration/investigation/stealth </h4>
<div class="outline-text-4" id="text-3-13-3">

</div>

</div>

<div id="outline-container-3-13-4" class="outline-4">
<h4 id="sec-3-13-4">Survival/puzzle </h4>
<div class="outline-text-4" id="text-3-13-4">


</div>
</div>

</div>

<div id="outline-container-3-14" class="outline-3">
<h3 id="sec-3-14">Tactical movement system: </h3>
<div class="outline-text-3" id="text-3-14">


<p>
Roguelike-ish play feel, but: all actions have an AP (action points)
cost, including moving the targeting reticle, so you must target
carefully.
</p>
<p> 
Different FCS (fire control systems) will have different size/shape
targeting reticles and different movement/targeting costs.
</p>
</div>

</div>

<div id="outline-container-3-15" class="outline-3">
<h3 id="sec-3-15">Shield barriers help you deal with many enemies at once </h3>
<div class="outline-text-3" id="text-3-15">


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Software design principles </h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Common Lisp implementation </h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Emacs-based mission editor and development environment </h3>
<div class="outline-text-3" id="text-4-2">

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Game objects create the UI (for example the targeting </h3>
<div class="outline-text-3" id="text-4-3">


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Detailed software design. </h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Console </h3>
<div class="outline-text-3" id="text-5-1">


<p>
The console is the imaginary RLX home game machine. It can do several things:
</p>

</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="todo TODO"> TODO</span> Open a window of a specified pixel size </h4>
<div class="outline-text-4" id="text-5-1-1">

</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="todo TODO"> TODO</span> Accept user input </h4>
<div class="outline-text-4" id="text-5-1-2">

</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="todo TODO"> TODO</span> Draw PNG bitmaps with transparency </h4>
<div class="outline-text-4" id="text-5-1-3">

</div>

</div>

<div id="outline-container-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="todo TODO"> TODO</span> Draw text and lines, boxes etc </h4>
<div class="outline-text-4" id="text-5-1-4">

</div>

</div>

<div id="outline-container-5-1-5" class="outline-4">
<h4 id="sec-5-1-5"><span class="todo TODO"> TODO</span> Load and utilize game code and resources from a "cart" (see below) </h4>
<div class="outline-text-4" id="text-5-1-5">

</div>

</div>

<div id="outline-container-5-1-6" class="outline-4">
<h4 id="sec-5-1-6"><span class="todo TODO"> TODO</span> Play sound effects and music </h4>
<div class="outline-text-4" id="text-5-1-6">

</div>

</div>

<div id="outline-container-5-1-7" class="outline-4">
<h4 id="sec-5-1-7"><span class="todo TODO"> TODO</span> Save and restore game state </h4>
<div class="outline-text-4" id="text-5-1-7">

</div>

</div>

<div id="outline-container-5-1-8" class="outline-4">
<h4 id="sec-5-1-8"><span class="todo TODO"> TODO</span> Dump screenshots </h4>
<div class="outline-text-4" id="text-5-1-8">


</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">Resources </h3>
<div class="outline-text-3" id="text-5-2">


<p>
A resource is an image, sound, text, or lisp program etc. implementing
some part of an RLX game. Each resource has a string identifier and an
associated file; .ogg or .wav for audio, .png for images, .lisp for
game code and object definitions, .rlx for some custom resources like
object maps, missions, cart definitions, etc.
</p>
<p>
A resource pack is a .tar.gz with various resource files and a
metadata file. The metadata file contains a lisp property list readable
by both Emacs Lisp and Common Lisp, and it maps resource names to
various data about them (including the resource type and relative file
name within the resource pack directory.)
</p>
<p>
It  would be  nice  if the  elisp-and-cl-compatible  .rlx files  could
contain a lot  of the game data, because this would  make it easier to
build more emacs-based editors and previewers.
</p>
<p>
Things to consider: 
</p>
<ul>
<li>Internationalization
</li>
<li>Licensing information included
</li>
</ul>


</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">Widgets </h3>
<div class="outline-text-3" id="text-5-3">


<p>
Widgets are UI elements that draw themselves by issuing commands to
the console. M-x gets a command line. The commands can also be
explored via a menu system.
</p>
<p>
Example widgets: map display, numeric display, message window, button,
command line
</p>
<p>
&mdash; BOBF, ignore everything after this, old notes etc.
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="todo TODO"> TODO</span> Review old notes from rlx.org etc </h2>
<div class="outline-text-2" id="text-6">


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="todo TODO"> TODO</span> Read RLX code and take design change notes </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="todo TODO"> TODO</span> Multiple layers </h3>
<div class="outline-text-3" id="text-7-1">


</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="todo TODO"> TODO</span> Device driver (default impl is SDL) </h4>
<div class="outline-text-4" id="text-7-1-1">

</div>

</div>

<div id="outline-container-7-1-2" class="outline-4">
<h4 id="sec-7-1-2"><span class="todo TODO"> TODO</span> Command processor / menu system </h4>
<div class="outline-text-4" id="text-7-1-2">

</div>

</div>

<div id="outline-container-7-1-3" class="outline-4">
<h4 id="sec-7-1-3"><span class="todo TODO"> TODO</span> Game logic (tactics, or roguelike, or pacman etc) </h4>
<div class="outline-text-4" id="text-7-1-3">

</div>
</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="todo TODO"> TODO</span> menu-oriented with ps2-style controller support (HOW WILL 8-way dirs work???) </h3>
<div class="outline-text-3" id="text-7-2">

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="todo TODO"> TODO</span> Different actions cost different AP amounts </h3>
<div class="outline-text-3" id="text-7-3">

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="todo TODO"> TODO</span> support both Tactics module and Roguelike module?? </h3>
<div class="outline-text-3" id="text-7-4">


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="todo TODO"> TODO</span> Play games </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="todo TODO"> TODO</span> XMESS </h3>
<div class="outline-text-3" id="text-8-1">

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="todo TODO"> TODO</span> Controller </h3>
<div class="outline-text-3" id="text-8-2">

</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="todo TODO"> TODO</span> video encoder card? </h3>
<div class="outline-text-3" id="text-8-3">

</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="todo TODO"> TODO</span> 2nd head? </h3>
<div class="outline-text-3" id="text-8-4">


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="todo TODO"> TODO</span> More detailed design treatment for VM </h2>
<div class="outline-text-2" id="text-9">


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="todo TODO"> TODO</span> Relaunch website </h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="todo TODO"> TODO</span> Choose a website update tool (rsync?) by asking mamalala </h3>
<div class="outline-text-3" id="text-10-1">

</div>

</div>

<div id="outline-container-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="todo TODO"> TODO</span> Reconfigure org-publish-project-alist to publish to ~/public<sub>html</sub> </h3>
<div class="outline-text-3" id="text-10-2">

</div>

</div>

<div id="outline-container-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="todo TODO"> TODO</span> Mirror ~/public<sub>html</sub> to mamalala.org </h3>
<div class="outline-text-3" id="text-10-3">

</div>

</div>

<div id="outline-container-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="todo TODO"> TODO</span> Contact Bastien re: blorg bugs </h3>
<div class="outline-text-3" id="text-10-4">

</div>

</div>

<div id="outline-container-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="todo TODO"> TODO</span> Fix stylesheet and templates </h3>
<div class="outline-text-3" id="text-10-5">

</div>

</div>

<div id="outline-container-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="todo TODO"> TODO</span> Easy way to paste images into a post </h3>
<div class="outline-text-3" id="text-10-6">

</div>

</div>

<div id="outline-container-10-7" class="outline-3">
<h3 id="sec-10-7"><span class="todo TODO"> TODO</span> Video capture? </h3>
<div class="outline-text-3" id="text-10-7">


</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="todo TODO"> TODO</span> Come up with company name </h2>
<div class="outline-text-2" id="text-11">


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="todo TODO"> TODO</span> Clean up studio </h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="done DONE"> DONE</span> Finish carpet tiles in corner </h3>
<div class="outline-text-3" id="text-12-1">

</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="done DONE"> DONE</span> Get rid of fridge </h3>
<div class="outline-text-3" id="text-12-2">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2008-06-19 Thu 11:50</span></span><br/>
</p></div>

</div>

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="done DONE"> DONE</span> Clean/organize shelves </h3>
<div class="outline-text-3" id="text-12-3">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2008-07-05 Sat 08:53</span></span><br/>
</p></div>

</div>

<div id="outline-container-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="todo TODO"> TODO</span> Vaccuum carpets </h3>
<div class="outline-text-3" id="text-12-4">

</div>

</div>

<div id="outline-container-12-5" class="outline-3">
<h3 id="sec-12-5"><span class="done DONE"> DONE</span> Reduce furniture clutter </h3>
<div class="outline-text-3" id="text-12-5">

<p> <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2008-07-05 Sat 08:53</span></span><br/>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-01 20:22:59 EDT</p>
<p class="author">Author: David O'Toole <dto@gnu.org></p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
